[{"slug":"spark","title1":"Playful Learning","title2":"Gaming with Autism","tileSub":"How mixed reality face-to-face full-body interaction games can support children with autism in learning about social initiation.","tileImg":"images/tiles/tile_spark","tileAlt":"The Spark logotype on a dark-purple background surrounded by little, colorful planets and some stars","year":"2019 — 2020","type":"Research, Interaction Design","summary":"Individuals affected by autism often experience difficulties with social interaction, which can already be observed at a young age. To support children with autism in learning about social initiation, researchers are studying the usage of game-based technology-enhanced interventions facilitating physical embodiment. In my master thesis project, I designed, developed and empirically validated such an intervention.","html":"\n\t<p>Most people will start exchanging non-verbal or verbal greetings with someone they see repeatedly, as it might be considered rude to not at least acknowledge the other person. Individuals affected by an autism spectrum condition (ASC) however might find it more difficult to engage in such social interactions. To support ASC children in learning about social initiation, researchers have been dedicating efforts to develop various intervention techniques. A promising line of research was found in the usage of game-based technology-enhanced interventions facilitating physical embodiment.</p>\n\t<p><a href='https://www.upf.edu/web/fubintlab/landsoffog' target='_blank'>Lands of Fog</a> is one exemplary intervention developed by the <a href='https://www.upf.edu/web/fubintlab' target='_blank'>Full-Body Interaction Laboratory of the Universitat Pompeu Fabra, Barcelona</a>. Although Lands of Fog has demonstrated positive results in comparison to a classic intervention, it yields further improvement potentials for the game’s interaction design. My thesis presented the initial exploration of these potentials through the creation of a possible successor called Spark.</p>\n\t<p>A preliminary analysis—contrasting preceding projects with relevant research literature—provided deeper knowledge on successful design features and possible design limitations. Appropriate design principles, development criteria and strategies were derived from the so gained knowledge and guided the development of Spark. In total 44 non-ASC children from local school classes provided insights for the evaluation of Spark’s game mechanics and usability during two testing sessions.</p>\n\t<p>The installation requires two high-quality projectors, allowing for a six by six meters projection onto the floor. Speakers accompany the visual stimuli with auditive ones. Each child was equipped with a custom-made handheld device. LED strips within the controllers allowed the position detection of the respective child by four ceiling-mounted cameras. The virtual environment was created using Unity. Ideally Spark is used by pairs of children with one ASC child and one non-ASC child. The game builds upon a deep space theme, where the children can create, collect and interact with planet like shapes, forming their own little universe.</p>\n\t<p>Due to restrictions enacted in response to the COVID-19 pandemic, the final evaluation of Spark was based on a study with 18 non-ASC children. Pairs of non-ASC children thereby tested Spark in a ten-minute play session before independently reporting their engagement and intention to join future sessions through a digital post-play questionnaire. Additionally, semi-structured interviews with three psychologists yielded an assessment of Spark’s potential efficacy when being used by pairs formed by one ASC and one non-ASC child.</p>\n\t<p>The results of the study show no significant difference in engagement between male and female non-ASC children while playing Spark. The psychologists attest Spark a comparable or even greater efficacy in fostering social initiations in ASC children than Lands of Fog—primarily attributable to Spark’s greater visual appeal, diversity of interactions and richness of stimuli. Furthermore, the study evinces a strong intention of non-ASC children to engage in future play-sessions of Spark.</p>\n"},{"slug":"logistics","title1":"Digital Revolution","title2":"Reimagining Logistics","tileSub":"Hand in hand with a truck and bus manufacturer, I worked on rethinking the rules of today’s logistics and co-creating its future.","tileImg":"images/tiles/tile_logistics","tileAlt":"Cards of the IoT Service Kit, displaying various emerging technologies, spread out on a purple surface.","year":"2018 — 2019","type":"Service Design, Co-Creation","summary":"Although being the largest industry worldwide, the logistic sector is digitizing itself only very slowly. In my role as senior designer I was responsible for shaping and leading the project’s design process. Whilst working as part of the project team together with two designers and the client’s PO, I moderated co-creation workshops and focus groups, I created assets like journey maps and co-designed an early-stage prototype.","html":"\n\t<p>This project started off with an initial user research including explorative interviews of external as well as internal stakeholders to identify and understand the needs of all parties involved. Especially talking to truck drivers unveiled unexpected pains that required urgent action. The creation of multiple journey maps and process flow charts allowed us to gain a holistic overview of the complex processes and to easily share our findings with other stakeholders.</p>\n\t<p>To find suitable solutions for the identified issues, we organized multiple co-creation workshops involving logistic experts as well as diverse client stakeholders. To support the participants in playfully exploring novel ideas and concepts, we used an adapted version of <a href='https://iotservicekit.com/' target='_blank'>the IoT Service Kit by Futurice</a>.</p>\n\t<p>The workshop further followed a clear framework based upon approaches used in generative research. We thereby started analyzing the current state and sharing previous experiences before diving into ideating about future solutions.</p>\n\t<p>After refining the generated ideas and concepts, the team designed first click-dummies to test different ideas within the field. After completing a positive proof of concept phase, I left the project as I started a master program abroad.</p>\n"},{"slug":"vitafy","title1":"Frictionless Shopping","title2":"Optimising Conversion","tileSub":"Evolving the design of an e-commerce startup to create a delightful shopping experience for food and fitness enthusiasts.","tileImg":"images/tiles/tile_vitafy","tileAlt":"The Vitafy logotype on a light-blue background next to a triangle, forming the Vitafy logo","year":"2016 — 2017","type":"Research, UX/UI Design","summary":"Vitafy is an e-commerce startup focused on selling healthy food and sport nutrition online. As one of two UX designers, I took responsibility for creating a delightful shopping experience for food and fitness enthusiast. My remits included various areas of the design process, reaching from conducting user interviews over product conception to final interface design.","html":"\n\t<p>As the UX team was newly formed, we started with an initial phase of establishing our design processes and integrating those into the existing agile development structures. To gain a deeper knowledge of our customers, we ran an extensive research project. Asides from conducting qualitative interviews, we analyzed quantitative data collected from the usage of the website together with secondary research data, such as benchmarking reports by the <a href='https://baymard.com/' target='_blank'>Baymard Institute</a>.</p>\n\t<p>The outcomes were visualized in form of user journey maps and user personas to support internal, interdepartmental communication. In combination with business requirements and development capacities we formed a monthly-reviewed product roadmap. From here we redesigned the whole store section by section.</p>\n\t<p>Each design change had to undergo an a/b test to assure the significance of its performance uplift, driving the optimization of the conversion rate. The usage of tracking software like <a href='https://analytics.google.com/' target='_blank'>Google Analytics</a>, <a href='https://www.inspectlet.com/' target='_blank'>Inspectlet</a> and <a href='https://www.optimizely.com/' target='_blank'>Optimizely<a/> supported our evaluation process.</p>\n\t<p>Over time we were able to establish a design system. This not only improve the consistency of the website, it furthermore crucially improved its performance. Revising the shop on a component basis also allowed us to improve the usability and accessibility of each entity.</p>\n"},{"slug":"ia-interface","title1":"Smart Interfaces","title2":"Designing for AI","tileSub":"An exploration of designing interfaces to conciliate between humans and artificial intelligence handling large chunks of textual information.","tileImg":"images/tiles/tile_ia","tileAlt":"The letters i and a, representing the shorthand for intelligence augmentation, framed by a white box on a red background.","year":"2018","type":"UX/UI Design, Co-Creation","summary":"AI is finding more and more areas of application. This raises the importance of how we design related interfaces. Within this project my client and I explored how the interface design can improve the confidence of the algorithm by identifying the appropriate forms of user feedback. My role included the analysis of user workflows, the collection of feature requirements as well as the design of the final interface.","html":"\n\t<p>Be aware that the designs and information presented have been purposely modified or omitted, due to a non-disclosure agreement.</p>\n\t<p>This client developed an algorithm to evaluate news articles. Based on the evaluation each article would be assigned a certain score. Users could therefore skim through a large chunk of information rapidly while getting crucial pieces highlighted. To improve the algorithm, it however required user feedback, which the existing interface did only partially allow for.</p>\n\t<p>I started by undertaking a heuristic evaluation of the existing interface to identify obvious design flaws in usability and gestalt. Within qualitative, exploratory interviews with users as well as the data science team we identified possible ways of direct and indirect user feedback that would integrate into the users’ daily workflows and usage habits.</p>\n\t<p>Based on the learnings, I created an initial set of mockups combined in a clickdummy. The users were then asked to test and evaluate the clickdummy within a workshop. Within different exercises the group prioritized the presented features. The further design and development roadmap was derived from this prioritization. The design drafts were reworked and evolved into  high-fidelity mockups. Finally, I prepared the specifications and required assets before handing over to the development team.</p>\n"},{"slug":"graphics","title1":"Graphic Design","title2":"Various Projects","tileSub":"This is a collection of various graphic design projects including stickers, book and podcast covers as well as a personal calendar creation.","tileImg":"images/tiles/tile_graphics","tileAlt":"A bunch of stickers with the imprint Girls-Just-Wanna-Have-Fundamental-Rights-And-Equal-Pay circling around a hand forming the peace sign.","year":"since 2017","type":"Graphic Design","summary":"As a designer I also like my works to be visually appealing. To train and enhance my visual skills, I occasionally work on graphic design projects as part of my spare time. This page presents a collection of pieces which I produced. Some works were based on requests by friends and made their way out into the world. Others were created for my personal use. In case you’re considering realizing a project together, just get in touch.","html":"\n<p>Podcast Cover for <a href='https://podcasts.apple.com/us/podcast/my-best-friends-wallet/id1509597779' target='_blank'>My Best Friend’s Wallet by Melanie Julison</a>, 2020</p>\n<p>Sekundär Calendar, private project, 2018</p>\n<p>Stickers for <a href='https://www.instagram.com/kaaaaatze/' target='_blank'>@kaaaaatze</a>, 2019</p>\n<p>Book Cover for <a href='https://www.meikearend.com/' target='_blank'>Meike Arend</a>, 2017</p>\n"},{"slug":"models","title1":"3D Artworks","title2":"Coming Soon","tileSub":"3D modeling and generative arts are new fields which I’m exploring at the moment. First pieces will be published here soon. Stay tuned.","tileImg":"images/tiles/tile_3d","tileAlt":"A placeholder image announcing that this content is coming soon.","year":"since 2020","type":"3D Modeling","summary":"Working in three-dimensional space has been an area of design which fascinated me for years. Especially with VR/AR technologies gaining ground, I believe the importance of designing in 3D is growing. Getting to work with VR/AR technologies during my masters finally unleashed the my motivation to learn more about 3D-modeling as well as generative arts and being able to create them myself. So this is me, exploring this field at the moment. First pieces will be published here soon. Stay tuned.","html":"\n"}]