{"slug":"graphics","title1":"Graphic Design","title2":"Various Projects","tileSub":"This is a collection of various graphic design projects including stickers, book and podcast covers as well as a personal calendar creation.","tileImg":"images/tiles/tile_graphics","tileAlt":"A bunch of stickers with the imprint Girls-Just-Wanna-Have-Fundamental-Rights-And-Equal-Pay circling around a hand forming the peace sign.","year":"since 2017","type":"Graphic Design","summary":"As a designer I also like my works to be visually appealing. To train and enhance my visual skills, I occasionally work on graphic design projects as part of my spare time. This page presents a collection of pieces which I produced. Some works were based on requests by friends and made their way out into the world. Others were created for my personal use. In case you’re considering realizing a project together, just get in touch.","figures":[{"src":"images/works/graphics/podcast_banner","alt":"A banner displaying two smartphones and a laptop listening to the podcast My Best Friends Wallet.","size":"wide"},{"src":"images/works/graphics/podcast_concept","alt":"The components of the podcast cover designed for the podcast My Best Friends Wallet.","size":"medium"},{"src":"images/works/graphics/podcast_contrast","alt":"The podcast cover of My Best Friends Wallet on light and on dark background.","size":"medium"},{"src":"images/works/graphics/calendar_detail_top","alt":"The upper part of a calendar page displaying a large image.","size":"medium"},{"src":"images/works/graphics/calendar_full","alt":"A list of all calendar pages included in the Sekundär Calendar by Marc Biemer.","size":"tall"},{"src":"images/works/graphics/calendar_detail_bottom","alt":"The lower part of a calendar page displaying a quote and the seconds within this month.","size":"medium"},{"src":"images/works/graphics/sticker_wall","alt":"A wall full of stickers, including a sticker of the Girls Just Wanna Have Fun-damental Rights and Equal Pay movement.","size":"medium"},{"src":"images/works/graphics/sticker_poster","alt":"The sticker of the Girls Just Wanna Have Fun-damental Rights and Equal Pay movement on top of the picture of a woman showing the peace sign during a protest.","size":"medium"},{"src":"images/works/graphics/sticker_banner","alt":"The different color versions of the sticker of the Girls Just Wanna Have Fun-damental Rights and Equal Pay movement","size":"wide"},{"src":"images/works/graphics/book_stock","alt":"The book cover (front) of Träume eines Mörders by Meike Arend.","size":"medium"},{"src":"images/works/graphics/book_composition","alt":"The book cover (all sides) of Träume eines Mörders by Meike Arend.","size":"medium"}],"html":"\n<p>Podcast Cover for <a href='https://podcasts.apple.com/us/podcast/my-best-friends-wallet/id1509597779' target='_blank'>My Best Friend’s Wallet by Melanie Julison</a>, 2020</p>\n<p>Sekundär Calendar, private project, 2018</p>\n<p>Stickers for <a href='https://www.instagram.com/kaaaaatze/' target='_blank'>@kaaaaatze</a>, 2019</p>\n<p>Book Cover for <a href='https://www.meikearend.com/' target='_blank'>Meike Arend</a>, 2017</p>\n"}