{"slug":"ia-interface","title1":"Smart Interfaces","title2":"Designing for AI","tileSub":"An exploration of designing interfaces to conciliate between humans and artificial intelligence handling large chunks of textual information.","tileImg":"images/tiles/tile_ia","tileAlt":"The letters i and a, representing the shorthand for intelligence augmentation, framed by a white box on a red background.","year":"2018","type":"UX/UI Design, Co-Creation","summary":"AI is finding more and more areas of application. This raises the importance of how we design related interfaces. Within this project my client and I explored how the interface design can improve the confidence of the algorithm by identifying the appropriate forms of user feedback. My role included the analysis of user workflows, the collection of feature requirements as well as the design of the final interface.","figures":[{"src":"images/works/ia/ia_wireframe_left","alt":"Abstract wireframes of the interface (1/2).","size":"medium"},{"src":"images/works/ia/ia_wireframe_right","alt":"Abstract wireframes of the interface (2/2).","size":"medium"}],"html":"\n\t<p>Be aware that the designs and information presented have been purposely modified or omitted, due to a non-disclosure agreement.</p>\n\t<p>This client developed an algorithm to evaluate news articles. Based on the evaluation each article would be assigned a certain score. Users could therefore skim through a large chunk of information rapidly while getting crucial pieces highlighted. To improve the algorithm, it however required user feedback, which the existing interface did only partially allow for.</p>\n\t<p>I started by undertaking a heuristic evaluation of the existing interface to identify obvious design flaws in usability and gestalt. Within qualitative, exploratory interviews with users as well as the data science team we identified possible ways of direct and indirect user feedback that would integrate into the users’ daily workflows and usage habits.</p>\n\t<p>Based on the learnings, I created an initial set of mockups combined in a clickdummy. The users were then asked to test and evaluate the clickdummy within a workshop. Within different exercises the group prioritized the presented features. The further design and development roadmap was derived from this prioritization. The design drafts were reworked and evolved into  high-fidelity mockups. Finally, I prepared the specifications and required assets before handing over to the development team.</p>\n"}