{"slug":"logistics","title1":"Digital Revolution","title2":"Reimagining Logistics","tileSub":"Hand in hand with a truck and bus manufacturer, I worked on rethinking the rules of today’s logistics and co-creating its future.","tileImg":"images/tiles/tile_logistics","tileAlt":"Cards of the IoT Service Kit, displaying various emerging technologies, spread out on a purple surface.","year":"2018 — 2019","type":"Service Design, Co-Creation","summary":"Although being the largest industry worldwide, the logistic sector is digitizing itself only very slowly. In my role as senior designer I was responsible for shaping and leading the project’s design process. Whilst working as part of the project team together with two designers and the client’s PO, I moderated co-creation workshops and focus groups, I created assets like journey maps and co-designed an early-stage prototype.","figures":[{"src":"images/works/logistics/logistics_journey_left","alt":"The user journey of an employee working at a droping station on a logistics terminal.","size":"medium"},{"src":"images/works/logistics/logistics_journey_right","alt":"The user journey of an employee working in inbound logistics.","size":"medium"},{"src":"images/works/logistics/logistics_iotkit","alt":"The IoT Service Kit used for co-creation workshops.","size":"tall"},{"src":"images/works/logistics/logistics_ws_top","alt":"Participants of a co-creation workshop discussing solutions using the IoT Service Kit.","size":"medium"},{"src":"images/works/logistics/logistics_ws_bottom","alt":"Another team of participants of a co-creation workshop discussing solutions using the IoT Service Kit.","size":"medium"}],"html":"\n\t<p>This project started off with an initial user research including explorative interviews of external as well as internal stakeholders to identify and understand the needs of all parties involved. Especially talking to truck drivers unveiled unexpected pains that required urgent action. The creation of multiple journey maps and process flow charts allowed us to gain a holistic overview of the complex processes and to easily share our findings with other stakeholders.</p>\n\t<p>To find suitable solutions for the identified issues, we organized multiple co-creation workshops involving logistic experts as well as diverse client stakeholders. To support the participants in playfully exploring novel ideas and concepts, we used an adapted version of <a href='https://iotservicekit.com/' target='_blank'>the IoT Service Kit by Futurice</a>.</p>\n\t<p>The workshop further followed a clear framework based upon approaches used in generative research. We thereby started analyzing the current state and sharing previous experiences before diving into ideating about future solutions.</p>\n\t<p>After refining the generated ideas and concepts, the team designed first click-dummies to test different ideas within the field. After completing a positive proof of concept phase, I left the project as I started a master program abroad.</p>\n"}