{"slug":"spark","title1":"Playful Learning","title2":"Gaming with Autism","tileSub":"How mixed reality face-to-face full-body interaction games can support children with autism in learning about social initiation.","tileImg":"images/tiles/tile_spark","tileAlt":"The Spark logotype on a dark-purple background surrounded by little, colorful planets and some stars","year":"2019 — 2020","type":"Research, Interaction Design","summary":"Individuals affected by autism often experience difficulties with social interaction, which can already be observed at a young age. To support children with autism in learning about social initiation, researchers are studying the usage of game-based technology-enhanced interventions facilitating physical embodiment. In my master thesis project, I designed, developed and empirically validated such an intervention.","figures":[{"src":"images/works/spark/spark_hardware_env","alt":"A technical drawing of the hardware environment used for Spark.","size":"medium"},{"src":"images/works/spark/spark_hardware_controller","alt":"A technical drawing of the handheld controllers utilized for playing Spark.","size":"medium"},{"src":"images/works/spark/spark_content1","alt":"An extract of the virtual elements found within Spark, e.g. an Asteroid.","size":"medium"},{"src":"images/works/spark/spark_play_lg1","alt":"Children playing Spark.","size":"tall"},{"src":"images/works/spark/spark_content2","alt":"An extract of other virtual elements found within Spark, e.g. a Black Hole.","size":"medium"},{"src":"images/works/spark/spark_rewards","alt":"3D models of the rewards received within Spark, e.g. a spaceship.","size":"wide"},{"src":"images/works/spark/spark_play_lg2","alt":"Another pair of children playing Spark.","size":"tall"},{"src":"images/works/spark/spark_play_sm","alt":"More children playing Spark.","size":"medium"},{"src":"images/works/spark/spark_data","alt":"Data Visualizations, heatmaps of the movement profiles of selected children.","size":"medium"}],"html":"\n\t<p>Most people will start exchanging non-verbal or verbal greetings with someone they see repeatedly, as it might be considered rude to not at least acknowledge the other person. Individuals affected by an autism spectrum condition (ASC) however might find it more difficult to engage in such social interactions. To support ASC children in learning about social initiation, researchers have been dedicating efforts to develop various intervention techniques. A promising line of research was found in the usage of game-based technology-enhanced interventions facilitating physical embodiment.</p>\n\t<p><a href='https://www.upf.edu/web/fubintlab/landsoffog' target='_blank'>Lands of Fog</a> is one exemplary intervention developed by the <a href='https://www.upf.edu/web/fubintlab' target='_blank'>Full-Body Interaction Laboratory of the Universitat Pompeu Fabra, Barcelona</a>. Although Lands of Fog has demonstrated positive results in comparison to a classic intervention, it yields further improvement potentials for the game’s interaction design. My thesis presented the initial exploration of these potentials through the creation of a possible successor called Spark.</p>\n\t<p>A preliminary analysis—contrasting preceding projects with relevant research literature—provided deeper knowledge on successful design features and possible design limitations. Appropriate design principles, development criteria and strategies were derived from the so gained knowledge and guided the development of Spark. In total 44 non-ASC children from local school classes provided insights for the evaluation of Spark’s game mechanics and usability during two testing sessions.</p>\n\t<p>The installation requires two high-quality projectors, allowing for a six by six meters projection onto the floor. Speakers accompany the visual stimuli with auditive ones. Each child was equipped with a custom-made handheld device. LED strips within the controllers allowed the position detection of the respective child by four ceiling-mounted cameras. The virtual environment was created using Unity. Ideally Spark is used by pairs of children with one ASC child and one non-ASC child. The game builds upon a deep space theme, where the children can create, collect and interact with planet like shapes, forming their own little universe.</p>\n\t<p>Due to restrictions enacted in response to the COVID-19 pandemic, the final evaluation of Spark was based on a study with 18 non-ASC children. Pairs of non-ASC children thereby tested Spark in a ten-minute play session before independently reporting their engagement and intention to join future sessions through a digital post-play questionnaire. Additionally, semi-structured interviews with three psychologists yielded an assessment of Spark’s potential efficacy when being used by pairs formed by one ASC and one non-ASC child.</p>\n\t<p>The results of the study show no significant difference in engagement between male and female non-ASC children while playing Spark. The psychologists attest Spark a comparable or even greater efficacy in fostering social initiations in ASC children than Lands of Fog—primarily attributable to Spark’s greater visual appeal, diversity of interactions and richness of stimuli. Furthermore, the study evinces a strong intention of non-ASC children to engage in future play-sessions of Spark.</p>\n"}