{"slug":"vitafy","title1":"Frictionless Shopping","title2":"Optimising Conversion","tileSub":"Evolving the design of an e-commerce startup to create a delightful shopping experience for food and fitness enthusiasts.","tileImg":"images/tiles/tile_vitafy","tileAlt":"The Vitafy logotype on a light-blue background next to a triangle, forming the Vitafy logo","year":"2016 — 2017","type":"Research, UX/UI Design","summary":"Vitafy is an e-commerce startup focused on selling healthy food and sport nutrition online. As one of two UX designers, I took responsibility for creating a delightful shopping experience for food and fitness enthusiast. My remits included various areas of the design process, reaching from conducting user interviews over product conception to final interface design.","figures":[{"src":"images/works/vitafy/vitafy_splash_left","alt":"Selected screens of the vitafy webshop (1/2).","size":"medium"},{"src":"images/works/vitafy/vitafy_splash_right","alt":"Selected screens of the vitafy webshop (2/2).","size":"medium"},{"src":"images/works/vitafy/vitafy_journey","alt":"A typical user journey of a Vitafy customer.","size":"wide"},{"src":"images/works/vitafy/vitafy_designsystem","alt":"An extract of the design system implemented for Vitafy.","size":"medium"},{"src":"images/works/vitafy/vitafy_persona","alt":"Multiple user personae created for internal communication at Vitafy.","size":"tall"},{"src":"images/works/vitafy/vitafy_ui","alt":"A smartphone with an open browser displaying the Vitafy webshop.","size":"medium"}],"html":"\n\t<p>As the UX team was newly formed, we started with an initial phase of establishing our design processes and integrating those into the existing agile development structures. To gain a deeper knowledge of our customers, we ran an extensive research project. Asides from conducting qualitative interviews, we analyzed quantitative data collected from the usage of the website together with secondary research data, such as benchmarking reports by the <a href='https://baymard.com/' target='_blank'>Baymard Institute</a>.</p>\n\t<p>The outcomes were visualized in form of user journey maps and user personas to support internal, interdepartmental communication. In combination with business requirements and development capacities we formed a monthly-reviewed product roadmap. From here we redesigned the whole store section by section.</p>\n\t<p>Each design change had to undergo an a/b test to assure the significance of its performance uplift, driving the optimization of the conversion rate. The usage of tracking software like <a href='https://analytics.google.com/' target='_blank'>Google Analytics</a>, <a href='https://www.inspectlet.com/' target='_blank'>Inspectlet</a> and <a href='https://www.optimizely.com/' target='_blank'>Optimizely<a/> supported our evaluation process.</p>\n\t<p>Over time we were able to establish a design system. This not only improve the consistency of the website, it furthermore crucially improved its performance. Revising the shop on a component basis also allowed us to improve the usability and accessibility of each entity.</p>\n"}